# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  [[-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
   [-1, 3, C2f, [128, True]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C2f, [256, True]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 6, C2f, [512, True]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P5/32
   [-1, 3, C2f, [1024, True]],
   [-1, 1, SPPF, [1024, 5]],
  #  [-1, 1, SPPF, [1024, 5]],
  #  [-1, 3, BoT3, [1024]],
  ]  # 9

# YOLOv8.0n head
head:
  [[4, 1, Conv, [128, 1, 1]], # 10
   [6, 1, Conv, [256, 1, 1]], # 11
 
   [[10, 11], 1, ASFF_2, [128, 0]], # 12
   [[10, 11], 1, ASFF_2, [256, 1]], # 13
 
   [-2, 1, C2f, [128, False]], # 14
   [-2, 1, C2f, [256, False]], # 15
 
   [9, 1, Conv, [512, 1, 1]], # 16
 
   [[14, 15, 16], 1, ASFF_3, [128, 0]], # 17
   [[14, 15, 16], 1, ASFF_3, [256, 1]], # 18
   [[14, 15, 16], 1, ASFF_3, [512, 2]], # 19
 
   [17, 1, C2f, [128, False]],
   [18, 1, C2f, [256, False]],
   [19, 1, C2f, [512, False]],

   [[20, 21, 22], 1, Detect_v8, [nc]],
  ]  # Detect(P3, P4, P5)

